In [3]:
import numpy as np
import pandas as pd

### 연습문제 4.1.1
<pre>
(1) 임의로 두 개의 시리즈 객체를 만든다. 
모두 문자열 인덱스를 가져야 하며 두 시리즈에 공통적으로 
포함되지 않는 라벨이 있어야 한다.

(2) 위에서 만든 두 시리즈 객체를 이용하여 사칙 연산을 한다.
</pre>

In [4]:
a = pd.Series([100,200,300,400],
    index = ['a','b','c','d'])
a

a    100
b    200
c    300
d    400
dtype: int64

In [11]:
b = pd.Series([10,20,30,40],
    index = ['a','b','c','e'])
b

a    10
b    20
c    30
e    40
dtype: int64

In [16]:
a - b

a     90.0
b    180.0
c    270.0
d      NaN
e      NaN
dtype: float64

### 연습문제 4.1.2
<pre>
다음 조건을 만족하는 임의의 데이터프레임을 하나 만든다.

(1) 열의 갯수와 행의 갯수가 각각 5개 이상이어야 한다.

(2) 열에는 정수, 문자열, 실수 자료형 데이터가 
각각 1개 이상씩 포함되어 있어야 한다.
</pre>

In [22]:
np.random.seed(2022)
d = pd.DataFrame(np.random.randint(40, 101, 15).reshape(5,3),
                columns = ['eng','math','sci'],
                index=['Adam','Bella','Charlie','David','Echo'])
d

         eng  math  sci
Adam      68    85   88
Bella     89    89   88
Charlie   95    64   58
David     64    56   93
Echo      81    73   67

In [23]:
d['fav'] = ['apple','banana','cucumber','donkey','elephant']
d

         eng  math  sci       fav
Adam      68    85   88     apple
Bella     89    89   88    banana
Charlie   95    64   58  cucumber
David     64    56   93    donkey
Echo      81    73   67  elephant

In [24]:
d['num'] = ['1.5','2.5','3.5','4.5','5.5']
d

         eng  math  sci       fav  num
Adam      68    85   88     apple  1.5
Bella     89    89   88    banana  2.5
Charlie   95    64   58  cucumber  3.5
David     64    56   93    donkey  4.5
Echo      81    73   67  elephant  5.5

In [ ]:
'''
data2 = {
    'a':[]
}
index = list('VWXYZ')
'''

### 연습문제 4.1.3
<pre>
다음 데이터프레임에서 지정하는 데이터를 뽑아내거나 처리하라.

data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
(1) 모든 학생의 수학 점수를 시리즈로 나타낸다.

(2) 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.

(3) 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.

(4) 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.

(5) 춘향의 점수를 데이터프레임으로 나타낸다.

(6) 향단의 점수를 시리즈로 나타낸다.
</pre>

In [4]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [30]:
df['수학']

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [8]:
df[['국어','영어']]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  80

In [9]:
df['avg'] = df.mean(axis=1).round(2)
df

    국어  영어  수학    avg   avg2
춘향  80  90  90  86.67  86.67
몽룡  90  70  60  73.33  73.33
향단  70  60  80  70.00  70.00
방자  30  80  70  60.00  60.00

In [7]:
df['avg2'] = np.mean(df.values[:,:-1], axis = 1).round(2)
df

    국어  영어  수학    avg   avg2
춘향  80  90  90  86.67  86.67
몽룡  90  70  60  73.33  73.33
향단  70  60  80  70.00  70.00
방자  30  80  70  60.00  60.00

In [11]:
df.drop(columns=['avg','avg2'], inplace = True)
df['영어'][-1] = 80
df['avg'] = df.mean(axis=1).round(2)
df

    국어  영어  수학    avg
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  80  70  60.00

In [12]:
# warning message를 보고 싶지 않으면
import warnings
warnings.filterwarnings('ignore')

In [13]:
# 제일 많이 사용 (위에서 부터 데이터프레임으로 보여줌)
df.head(1)
# df.iloc[:1,:]

    국어  영어  수학    avg
춘향  80  90  90  86.67

In [15]:
df[:'춘향']

    국어  영어  수학    avg
춘향  80  90  90  86.67

In [16]:
df.T['향단']

국어     70.0
영어     60.0
수학     80.0
avg    70.0
Name: 향단, dtype: float64

In [14]:
# 향단의 점수를 데이터프레임으로
df.head(3).tail(1)

    국어  영어  수학   avg
향단  70  60  80  70.0

In [42]:
df.loc['향단']

국어     70.0
영어     60.0
수학     80.0
avg    70.0
Name: 향단, dtype: float64

### 연습문제 4.3.1
<pre>
모든 행과 열에 라벨을 가지는 5 x 5 이상의 크기를 가지는 데이터프레임을 만든다.

10가지 이상의 방법으로 특정한 행과 열을 선택한다.
</pre>

In [18]:
df = pd.DataFrame(np.arange(25).reshape(5,5), columns=list('ABCDE'), index=list('vwxyz'))
df

    A   B   C   D   E
v   0   1   2   3   4
w   5   6   7   8   9
x  10  11  12  13  14
y  15  16  17  18  19
z  20  21  22  23  24

In [45]:
df2 = pd.DataFrame(np.random.randint(40,101,25).reshape(5,5),
                    columns = ['a','b','c','d','e'],
                    index = ['apple','banana','cucumber','donkey','elephant']
)
df2

           a   b   c   d   e
apple     61  77  92  96  90
banana    98  98  59  52  85
cucumber  89  66  52  54  72
donkey    53  53  92  82  93
elephant  40  85  69  63  77

In [81]:
df2.a.banana, df2['a']['banana'], df2.iloc[1][0], df2.iloc[1,0], df2.iloc[1].a, df2.iloc[1]['a'], df2.loc['banana'][0], df2.loc['banana','a'], df2.loc['banana']['a'], df2.loc['banana'].a

(98, 98, 98, 98, 98, 98, 98, 98, 98, 98)